Repository: walthertimmer/scubaclub
Catalog: scubaclub/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Required. 150 characters or fewer. Only letters and numbers are allowed.
nl: Verplicht. Maximaal 150 karakters. Alleen letters en nummers zijn toegestaan.

source: Only letters and numbers are allowed in the username.
nl: Alleen letters en nummers zijn toegestaan in de gebruikersnaam.

source: Login
nl: Inloggen

source: Activation Failed
nl: Activeren is mislukt

source: The activation link is invalid or has expired.
nl: De activitatie link is foutief of niet meer geldig.

source: Register again
nl: Registreer opnieuw

source: Register
nl: Registreer

source: Change language
nl: Wijzig taal

source: Welcome to ScubaClub
nl: Welkom bij ScubaClub

source: Organize your dives, grow your scuba club, and connect with fellow scuba enthusiasts!
nl: Organiseer duiken, groei jouw duikvereniging en maak connecties met andere duikfanaten!
